# Importação e Estruturas de Dados

1. Temos aqui como `verificar tipos, variáveis e shape` de um DF
2. Como `chamar, Alterar e remover duplicatas de colunas`
3. Como alterar `index e nome de colunas` em Séries e Df
4. Como Criar e Alterar `séries e Df`
5. Como Importar dados de  `JSON, TXT, EXCEL, e HTML`

In [3]:
import pandas as pd

In [2]:
# Leitura de csv com pandas. 
# shift+tab mostram os argumentos da função
dados = pd.read_csv('Datasets/aluguel.csv', sep =';')

## Métodos e Atributos de Informações das Variáveis do Data Frame.
### ** Um data frame em Python tem colunas como um conjunto de Séries (pandas)

In [3]:
# Verificando o tipo de um Objeto
type(dados)

pandas.core.frame.DataFrame

In [4]:
# Informações sobre o data frame
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

In [5]:
# Tipos de Variáveis do dataframe
# Atributo do data frame
dados.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [6]:
dados.shape

(32960, 9)

In [7]:
print('A base de dados apresenta {} registros (imóveis) e {} variáveis'.format(dados.shape[0], dados.shape[1]))

A base de dados apresenta 32960 registros (imóveis) e 9 variáveis

In [8]:
# Indice do DF e Séries
dados.index

RangeIndex(start=0, stop=32960, step=1)

## Manipulando as Colunas de um Data Frame

In [9]:
# Chamando uma coluna do Df
## Uma coluna do DF é uma Série
### Temos duas formas
# 1º forma
dados['Tipo']
# 2º forma
dados.Tipo

0                      Quitinete
1                           Casa
2        Conjunto Comercial/Sala
3                    Apartamento
4                    Apartamento
                  ...
32955                  Quitinete
32956                Apartamento
32957                Apartamento
32958                Apartamento
32959    Conjunto Comercial/Sala
Name: Tipo, Length: 32960, dtype: object

In [10]:
type(dados.Tipo)

pandas.core.series.Series

In [11]:
tipo_de_imoveis = dados.Tipo

In [12]:
tipo_de_imoveis.head(10)

0                  Quitinete
1                       Casa
2    Conjunto Comercial/Sala
3                Apartamento
4                Apartamento
5                Apartamento
6                Apartamento
7         Casa de Condomínio
8         Casa de Condomínio
9    Conjunto Comercial/Sala
Name: Tipo, dtype: object

In [13]:
# Removendo Duplicadas com .drop_duplicates()
tipo_de_imoveis.drop_duplicates(inplace=True)
tipo_de_imoveis

# o argumento inplace =true persiste a alteração no DF/ Série
# Por padrão pega a primeira ocorrencia e exclui o resto.

0                          Quitinete
1                               Casa
2            Conjunto Comercial/Sala
3                        Apartamento
7                 Casa de Condomínio
16                    Prédio Inteiro
17                              Flat
29                        Loja/Salão
80           Galpão/Depósito/Armazém
83                    Casa Comercial
117                     Casa de Vila
159                   Terreno Padrão
207                      Box/Garagem
347                             Loft
589      Loja Shopping/ Ct Comercial
2157                         Chácara
3354           Loteamento/Condomínio
4379                           Sítio
4721                   Pousada/Chalé
6983                          Studio
9687                           Hotel
23614                      Indústria
Name: Tipo, dtype: object

In [14]:
# Resetando o index da série/DF
tipo_de_imoveis.reset_index()
tipo_de_imoveis.head()

0                  Quitinete
1                       Casa
2    Conjunto Comercial/Sala
3                Apartamento
7         Casa de Condomínio
Name: Tipo, dtype: object

In [15]:
# Outra forma
tipo_de_imoveis.index = range(tipo_de_imoveis.shape[0])

In [16]:
tipo_de_imoveis

0                       Quitinete
1                            Casa
2         Conjunto Comercial/Sala
3                     Apartamento
4              Casa de Condomínio
5                  Prédio Inteiro
6                            Flat
7                      Loja/Salão
8         Galpão/Depósito/Armazém
9                  Casa Comercial
10                   Casa de Vila
11                 Terreno Padrão
12                    Box/Garagem
13                           Loft
14    Loja Shopping/ Ct Comercial
15                        Chácara
16          Loteamento/Condomínio
17                          Sítio
18                  Pousada/Chalé
19                         Studio
20                          Hotel
21                      Indústria
Name: Tipo, dtype: object

## Construindo Data Frames e Séries

### Séries pandas

In [6]:
# pode ser a partir de uma lista
data = [1, 2, 3, 4, 5]

In [9]:
# função pd.Series
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [11]:
# Podemos mudar definir os indices na criação
index = ['linha'+ str(i) for i in range(5)]
s = pd.Series(data=data, index=index)
s

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [15]:
# Podemos Criar uma séries a partir de um Dicionário
## Nesse caso, a chave é index e o Valor é Valor.
data = {'linha'+ str(i): i for i in range(5)}
data

{'linha0': 0, 'linha1': 1, 'linha2': 2, 'linha3': 3, 'linha4': 4}

In [16]:
s = pd.Series(data)
s

linha0    0
linha1    1
linha2    2
linha3    3
linha4    4
dtype: int64

### Operações básicas com Séries

In [18]:
# soma/multiplicação com escalar k
## soma/multiplicação k a cada valor da série
s1 = s+1
s1

linha0    1
linha1    2
linha2    3
linha3    4
linha4    5
dtype: int64

In [19]:
# Operação entre séries de mesmo index
s2 = s + s1
s2

linha0    1
linha1    3
linha2    5
linha3    7
linha4    9
dtype: int64

### Séries ==> Dataframe

In [17]:
tipo_de_imovel = pd.DataFrame(tipo_de_imoveis)
tipo_de_imovel.head()

                      Tipo
0                Quitinete
1                     Casa
2  Conjunto Comercial/Sala
3              Apartamento
4       Casa de Condomínio

In [18]:
# nomeando o index
tipo_de_imovel.columns.name = 'Id'

In [19]:
tipo_de_imovel.head()

Id                     Tipo
0                 Quitinete
1                      Casa
2   Conjunto Comercial/Sala
3               Apartamento
4        Casa de Condomínio

## Construindo um Data Frame

__Podemos construir um DF apartir de uma listas aninhadas ou de um Dicionário__

In [20]:
# Df de listas aninhadas
data = [[1, 2, 3], 
        [4, 5, 6], 
        [7, 8, 9]]

df1 = pd.DataFrame(data)
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [23]:
# Adicionando nome das Colunas
columns = ['Coluna' + str(i) for i in range(3)]

# Adicionando index na criação do Df
index = ['Linha' + str(i) for i in range(3)]

df1 = pd.DataFrame(data=data, index=index, columns=columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

 __Data Frames a partir de dicionários, tem em suas colunas as chaves e nas linhas os valores, mas quando temos dicionários aninhados, as chaves dos dicionários 'internos' é o index do DF__

In [24]:
data = {'Coluna0': {'Linha0': 1, 'Linha1': 4, 'Linha2': 7},
 'Coluna1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 8},
 'Coluna2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [31]:
df2 = pd.DataFrame(data)

df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

## Alterando Valores do DF

In [28]:
# alterando uma coluna
df2['Coluna2'] = 'A'
df2

        Coluna0  Coluna1 Coluna2
Linha0        1        2       A
Linha1        4        5       A
Linha2        7        8       A

In [33]:
df2 = pd.DataFrame(data)
df2

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [34]:
# Alteração condicional
df2[df2 > 3] = "B"
df2

       Coluna0 Coluna1 Coluna2
Linha0       1       2       3
Linha1       B       B       B
Linha2       B       B       B

## Importação de Diversas Fontes

* JSON, TXT, EXCEL, e HTML

In [20]:
# Importação com Python puro
json = open('Datasets/aluguel.json')
print(json.read())

[{"Tipo":"Quitinete","Bairro":"Copacabana","Quartos":1,"Vagas":0,"Suites":0,"Area":40,"Valor":1700.0,"Condominio":500.0,"IPTU":60.0},
{"Tipo":"Casa","Bairro":"Jardim Bot\u00e2nico","Quartos":2,"Vagas":0,"Suites":1,"Area":100,"Valor":7000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Barra da Tijuca","Quartos":0,"Vagas":4,"Suites":0,"Area":150,"Valor":5200.0,"Condominio":4020.0,"IPTU":1111.0},
{"Tipo":"Apartamento","Bairro":"Centro","Quartos":1,"Vagas":0,"Suites":0,"Area":15,"Valor":800.0,"Condominio":390.0,"IPTU":20.0},
{"Tipo":"Apartamento","Bairro":"Higien\u00f3polis","Quartos":1,"Vagas":0,"Suites":0,"Area":48,"Valor":800.0,"Condominio":230.0,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Vista Alegre","Quartos":3,"Vagas":1,"Suites":0,"Area":70,"Valor":1200.0,"Condominio":null,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Cachambi","Quartos":2,"Vagas":0,"Suites":0,"Area":50,"Valor":1300.0,"Condominio":301.0,"IPTU":17.0},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Barra da Tijuca","Quartos":5,"Vagas":4,"Suites":5,"Area":750,"Valor":22000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Ramos","Quartos":2,"Vagas":2,"Suites":0,"Area":65,"Valor":1000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Centro","Quartos":0,"Vagas":3,"Suites":0,"Area":695,"Valor":35000.0,"Condominio":19193.0,"IPTU":3030.0}]

In [21]:
# Importação JSON com pandas
df_json = pd.read_json('Datasets/aluguel.json')
df_json

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

In [22]:
# Abrindo TXT com python puro
txt = open('Datasets/aluguel.txt')
print(txt.read())

Tipo	Bairro	Quartos	Vagas	Suites	Area	Valor	Condominio	IPTU
Quitinete	Copacabana	1	0	0	40	1700	500	60
Casa	Jardim BotÃ¢nico	2	0	1	100	7000
Conjunto Comercial/Sala	Barra da Tijuca	0	4	0	150	5200	4020	1111
Apartamento	Centro	1	0	0	15	800	390	20
Apartamento	HigienÃ³polis	1	0	0	48	800	230
Apartamento	Vista Alegre	3	1	0	70	1200
Apartamento	Cachambi	2	0	0	50	1300	301	17
Casa de CondomÃ­nio	Barra da Tijuca	5	4	5	750	22000
Casa de CondomÃ­nio	Ramos	2	2	0	65	1000
Conjunto Comercial/Sala	Centro	0	3	0	695	35000	19193	3030

In [23]:
# Importando TXT  com pandas
df_txt = pd.read_table('Datasets/aluguel.txt')
df_txt

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

In [24]:
# Importação Excel com pandas
df_excel = pd.read_excel('Datasets/aluguel.xlsx')
df_excel

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

In [25]:
# Importação Excel com pandas
## retorna uma lista de data frames, que cada elemento são as tabelas do html
df_html = pd.read_html('https://www.federalreserve.gov/releases/h3/current/default.htm')

In [26]:
df_html[0].head()

         Date      Reserve balances required                              \
         Date Reserve balance requirements 1 Top of penalty- free band 2
0     Month 7                        Month 7                     Month 7
1   Aug. 2019                         134639                      148114
2  Sept. 2019                         134707                      148188
3   Oct. 2019                         134998                      148509
4   Nov. 2019                         140705                      154787

                                 Reserve balances maintained 4  \
  Bottom of penalty- free band 3                         Total
0                        Month 7                       Month 7
1                         121167                       1520876
2                         121227                       1439771
3                         121489                       1481513
4                         126625                       1529341

                                                                 \
  Balances maintained to satisfy reserve balance requirements 5
0                                            Month 7
1                                             147555
2                                             147498
3                                             148050
4                                             154256


  Balances maintained that exceed the top of the penalty- free band 6
0                                            Month 7
1                                            1373321
2                                            1292273
3                                            1333462
4                                            1375085